README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-02-25 Mon 00:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Test Org-Mode Page</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Test Org-Mode Page</h1>

<div id="outline-container-org2a38254" class="outline-2">
<h2 id="org2a38254">devops</h2>
<div class="outline-text-2" id="text-org2a38254">
<p>
Since <a href="https://old.reddit.com/r/Crostini/">Crostini</a> comes with Python3, use it instead of bash for bootstrapping a dev environment.
</p>
</div>
</div>

<div id="outline-container-org20f2927" class="outline-2">
<h2 id="org20f2927">bootstrap.py</h2>
<div class="outline-text-2" id="text-org20f2927">
<p>
Installs things.  Assumes passwordless <code>sudo</code> privilege, which is the case in the Crostini container.
</p>
</div>

<div id="outline-container-org2a174db" class="outline-3">
<h3 id="org2a174db">usage</h3>
<div class="outline-text-3" id="text-org2a174db">
<div class="org-src-container">
<pre class="src src-shell">$ python3 bootstrap.py &lt;options&gt; [--dry-run]
</pre>
</div>
<ul class="org-ul">
<li><code>options</code> are any of the recipes in the <code>TARGETS</code> dictionary.</li>
<li>use <code>--dry-run</code> to see what would happen without changing anything.</li>
</ul>
</div>
</div>
<div id="outline-container-org91b8873" class="outline-3">
<h3 id="org91b8873">examples</h3>
<div class="outline-text-3" id="text-org91b8873">
<div class="org-src-container">
<pre class="src src-shell">$ python3 bootstrap.py k
</pre>
</div>
<p>
This would clone the <a href="https://github.com/kevinlawler/kona.git">kona</a> source from GitHub, <code>make</code> it, and put a symlink to the executable in <code>$HOME/bin/k</code>.
</p>
<div class="org-src-container">
<pre class="src src-shell">$ python3 bootstrap.py j xinu
</pre>
</div>
<p>
This would install <a href="https://code.jsoftware.com/wiki/System/Installation/Linux">J</a> as a <code>.deb</code> package, and clone my private copy of the <a href="https://github.iu.edu/SICE-OS/xinu">Xinu</a> repo.
</p>
</div>
</div>
<div id="outline-container-org11edc8b" class="outline-3">
<h3 id="org11edc8b">help text</h3>
<div class="outline-text-3" id="text-org11edc8b">
<p>
Call the script with no arguments to see this message:
</p>
<div class="org-src-container">
<pre class="src src-shell">Usage: python3 bootstrap.py &lt;options&gt; [--dry-run]
Possible options:

emacs: sudo apt-get install -y emacs25-nox unifont
xinu:  sudo apt-get install -y qemu gawk bison flex libz-dev gcc-arm-none-eabi make
       git clone --recursive git@github.iu.edu:ashroyer/xinu-s19.git ~/repo/xinu-s19
j:     curl -O http://www.jsoftware.com/download/j807/install/j807_arm64.deb
       sudo dpkg -i j807_arm64.deb
       ln -s $(<span style="color: #ff00ff;">which</span> ijconsole) $<span style="color: #b35000;">HOME</span>/bin/j
       rm j807_arm64.deb
e110:  sudo apt-get install -y python3-pip
       pip3 install --user myhdl
k:     sudo apt-get install -y rlwrap make
       git clone git@github.com:kevinlawler/kona.git $<span style="color: #b35000;">HOME</span>/repo/kona
       <span style="color: #75507b;">cd</span> $<span style="color: #b35000;">HOME</span>/repo/kona &amp;&amp; make &amp;&amp; <span style="color: #75507b;">cd</span> -
       rm -f $<span style="color: #b35000;">HOME</span>/bin/k
       ln -s $<span style="color: #b35000;">HOME</span>/repo/kona/k $<span style="color: #b35000;">HOME</span>/bin/k

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc89d178" class="outline-2">
<h2 id="orgc89d178">ssh<sub>config</sub></h2>
<div class="outline-text-2" id="text-orgc89d178">
<p>
Copy this file to <code>$HOME/.ssh/config</code> for better ssh-ing.  BTW you have to put the public key on the server first, either via the GitHub/GitLab web UI, or <code>ssh-copy-id</code>.
</p>
</div>
</div>

<div id="outline-container-org8184db2" class="outline-2">
<h2 id="org8184db2">TinyTeX</h2>
<div class="outline-text-2" id="text-org8184db2">
<p>
TinyTeX only installs what you need.
</p>

<ul class="org-ul">
<li><a href="https://yihui.name/tinytex/">homepage</a></li>
<li><a href="https://github.com/brimoran/Linux-on-ASUS-C101PA">someone using it on Crostini</a></li>
</ul>
</div>

<div id="outline-container-org45dd770" class="outline-3">
<h3 id="org45dd770">usage</h3>
<div class="outline-text-3" id="text-org45dd770">
<ol class="org-ol">
<li>try to build your <code>*.tex</code> files</li>
<li>see an error message like <code>! LaTeX Error: File `times.sty' not found.</code></li>
<li><p>
run <code>tlmgr search --global --file "filename"</code> to see what package provides the file (in this case the output looks like):
</p>

<div class="org-src-container">
<pre class="src src-shell">$ tlmgr search --global --file <span style="color: #5c3566;">"/times.sty"</span>
psnfss:
        texmf-dist/tex/latex/psnfss/times.sty
...
</pre>
</div></li>
<li>finally do <code>tlmgr install psnfss</code> to get the needed thing</li>
<li>if you're awesome, note which packages were installed (i.e. add them to <code>bootstrap.py</code>) to avoid this step in the future</li>
</ol>

<p>
A general-purpose fix for other confusing errors is:
</p>
<div class="org-src-container">
<pre class="src src-shell">tlmgr update --self --all
tlmgr path add
fmtutil-sys --all
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
